#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "6431882f64af7621924d79926a051d26" -> "d34371f0b7addbe6915edb9b44bab6f3"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "eba17bedaa876461815aff38af9cdf3c" -> "634613f62f78675ed2227c48559e5b92"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "a25acb5d65e31105d60012e14d12a4a2" -> "f376569748df3bc311631e93137450e5"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "36d8061e19e395c08720276b0ce4f518" -> "b806a061d7e551a7d58badc29a22bfb2"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "f120c4c4f8483aec4a578918c374231b" -> "d3f0683e5a62b9d7507350c22944b124"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "4a2d5d94346f0b36f8869c074653ced8" -> "f702cdbba2ec216a6b76951561b8799c"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "f05134f92c4071046f3f2a809229d4bc" -> "70e650185dc69025e0af8d6a8d055ca5"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "c24dcb33ed514b9396a02b97e1ba13a7" -> "8b2cbb4b957a9e7e683193f8e524d297"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "1dacb7da3c874aa48b9ab44ec2b167ad" -> "4e2854731724700f3f9debd3bc470d44"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "9f0446809da4714c2528381258c0de4b" -> "9a34b564b88137eb582beaac63a6eb53"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "e31a8a84134b9be1e82b4a8fee8b7f2c" -> "480a4f925fce233b16b9329e69192c38"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "97968caee05cbea390b63b2fbb747ba3" -> "2a69a108828f39db9e25c6b766e77db1"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "2b9bcde09a7d832731c933d0e26b3ef2" -> "82b56d21e8af23d09a82d19b92697144"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "fc92b076d2fa93951b37a16b9e93175b" -> "5e01d33036279e73a4a5e1cb38697b94"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "804692e7011b8e3a2f1bef62d635a3eb" -> "83a4726a10751b3a649e25c3c4b7ba58"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.etl_script_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "etl_script_object" {
      ~ etag               = "c3d805aa3d0ba1a0050dc2bfb39cdcdd" -> "b22dbea84a866cd86a09b17802e7ae78"
        id                 = "pyspark/kpinetwork_analizer.py"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "f82acf9b749d39dc20d262de1ad930c3" -> "00d5ff0e9214283f72cb5b99279e6667"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "928486a82ba0384126939b8604ccf97a" -> "2fedd64656f53a42add41b01d3906c96"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "ee550829385a3794e2b5fa42955d56d2" -> "828b87dc655dbd7a7ab2bd28c302a701"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "e4ac811c9717bea79b0bf1dc8e881c94" -> "2bda2331454f50ec9db2a2e34327cf66"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "f800188ad1752f141eb80c84b9cb4d1b" -> "9997fb0770cab54c8b088d8902440ea1"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "8a5f2bf25a66da5e6373788ccf6e448d" -> "21ae6b2b95ad8e1be3ea1069d388f853"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "d4063c29a163810510582878b3a7df8e" -> "6e75a909f0bf8f67e94a0070bb5fcf29"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "4dfda2672beefc45f88eef6f5e2bfc48" -> "d5b56ea9ec10626b7cfe34c4adc751cb"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "8e71cb4b89a60ba375c377858fdc5290" -> "fb37926af5d1675f6574ec46d171217e"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "dcb14723b5fc484199d1c1ad2d9dc36d" -> "22b159e29e8ac3a04866260236aebe16"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "075c77b086e95d2d6271c49e674d9dc8" -> "fba316b19aeccf6b218cadfb3347a43c"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "50cf14fa75e3fcb2721d2950c0890d86" -> "8fe28a6d98b2b5e272d6d37797cdf913"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "be0d051318471aa157c612afaa90b1c7" -> "a92c0416d30c8d876cfdc64e92193b9e"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7679aa337cf924d1430a28eaf5d9be50" -> "4204e9669c2b6894746181bfb902bd28"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "a49351fe18204f308ad1cc274697fe17" -> "8a8df4b54986628dbf732379d8a84d6f"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "48cbd1f4e3599b59413b07e41225121f" -> "ae7a128cd5fd3d03682ec8b55fa07e70"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "decfe4b2de9307351ea672f44bee7f7c" -> "5f6e513cfd0dc009ed4d21a895ee01dc"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "a924036a35814b94418327f238f28b93" -> "b6f24e8cacf1f35ab6815ea15059877e"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "26b6d7290f0f1e278d39df54342c4e5a" -> "917ca4cad9f8f75eedc79b299c187a34"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "f0370ac7fcbb2cc38041165dd33e1687" -> "f82b82bad81378cecef0a3b798ea7324"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "2be272c8219dc697fb532f251f19d6ec" -> "8d5dbdfcc4c5ddb9f9e2275dfb5f3ab9"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "1a46fe34158cb52a15cdc452647b8a84" -> "ae5aa2b9275a419cc41ed51cee18c18c"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "f1d3b644ee738245a8ba9a6fe209769c" -> "a802d03109cd316d830948bc6c76cda8"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "0410ad73d579cb00b94b74367ce47833" -> "e96a4b6c7b3814b6120627d47fb85f26"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "d9b95dc935c62aae2ed3361643c84c99" -> "c45e5c205fa16d137b6cbac7daecee90"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "ee9759247f5f0e8559af2c7948c39794" -> "1100b0fe37384c33423dc932b22bb526"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "ed8a0b28139d35ba6424496d49e89f0e" -> "70122a627f994a48a83363838cab4a54"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "2a05f33a9cbadd3905e6654aafd54170" -> "aef3f7443adf5a738fa420067ff61531"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "2495b8fd4e5474f876a4a52f558ca46f" -> "b8a4fa02f38c85cecf017294bb7fb294"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "b97184d92065edf710bffb88f02df6fd" -> "9f21eb6f904610a2413c5509c9a78c0e"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "7737e7c7f175e50ac7fbd38620c1784c" -> "ccd047294807eddf7825eec96d521a56"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.codebuild.aws_codebuild_source_credential.git_credential must be replaced
-/+ resource "aws_codebuild_source_credential" "git_credential" {
      ~ arn         = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ id          = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ token       = (sensitive value) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "rDqb33ozX0a/Sw6hcIoDrCTXzc5payp5Atpv2KXyZMQ=" -> "1AKAvh1TBcSU01/mwounFfYlCSalejsiWJxzU1Omsao="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "mbAWEGWXPK1Qzbl9MBClG8f9IuLMU5MXBaFBxVV9qx8=" -> "tftBtkg5GUoblka3uJtkGdquGHoNePpO3OwLNgjd6o8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "xwaIAUlpzlUHvV3VI2Smy9HQYSe/fXnVNxRzjvBkS4Q=" -> "ayvb/EVst0D/9C3QBIiH19WeN1a1TPk6wjdeUxTV+ZE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "INKhUfDYNqVQAAhOBqCBNED0hpKWScsamuKzMH7Nd/Q=" -> "z2PMz79BsFvT11e31/O0TYmKIYTONOhY22LZ8xpvE3A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "afctkexUfsgHYiDaWJDsC3KE978+36qaOTYp5NI4vyI=" -> "UgO6XuZdpgnaV+oTQkolx3rp0BnnBOD/hnUEhotzcPs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "1kn+whYSweQQ9j9cZiGtG4EjX0qqmfIqnDcsZZ6KSrw=" -> "gJwGOxqIbeIP2QO9Xff+AZWUbJGv2g81CqTv7doZy1g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "vIxf+oxAmgpVcbH16yvUN0K59zRnlnAiWYQVP+Uj0IY=" -> "kHBTR6f6UFv79AKV9bxj3Q9i99607FWEHg5mL8dHV+g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "TmjynSuJ0e5z1RPqiA5dxKzmSmaB2CWWpcTphI4R87Y=" -> "+h4ypBvZ1hkeLKCcoJUwmo2qqfga57EDQ7VaA7zmQvA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "dRhMhzMniHq3kH4bXJj17s+lq1OImy/fYcfJCol50WA=" -> "iuKkStD6/JkApbLOy5SbLGD5Ib34gMjcigdAbmvrx00="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "EqLDsYq6AZT44NZKMdgB6u9+ShiTDSYxbasBowVzO3Q=" -> "KmSPsIa2HKtI9MUVhLBXSui72Iuu78SwDabkM3/hg5o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "ag+xYDGqm2uyUz7JBj31hSYBHu7MEda07lgV/HXZwJs=" -> "kpxaFW2Qn2YRILg6fQukAeLng+8QrqGzt5kZJ8nogp0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "X0pPP9d1LHtaf5uTbfvv4Xc0oRU3tqQJzPjuP5ucuTk=" -> "jJZcHvm/p2Vnee3mtJgNyAXpnZz61vNT8n+p0KUDNj4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZrZLB2tv1SQirIarirzWbZPulRQ9195aSWhnV0vKZTk=" -> "UqPS1Bdxzhxbjzea9VwPyLkHVR2tCbteOHKL3Ddi9Hc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "DBG3FKZeKOJNdotKGhMhLRIgEOSSebrIN9AKZ6WbFO0=" -> "F+DNkdIkHCaoytxPlV5mk/oxgf5SXcjWDoTaljEqQh0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "AIuZ3GlgbUGQOZZwHFYmLIPRS1QnVNdnSbjFPkOs5zU=" -> "7XEVC7NwIDq8OsQlK4NvBV+l3CvLG5+ihzqt5aa/x8Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "S+okPOHrzOngmtnSwIoYeBKG84t7hyDroAi/80vIgeg=" -> "yd0IL1k4N5+zYulCfhPFlrmfJ4BXTOg7hrhmzvzVTH4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "5oMZcVJyOyOD2zoQmcoJYb41M8yYJUiWLBBA6pV4afg=" -> "uCg69vLxlM7u/MAcYy+GRYPg+GCgHF1xYF5Y1mVexpo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "/A6L2fMHKv7z23dMdVyXsaBAahkTj5l3QGrkpY9/jJs=" -> "s0pmE8Cja7zmza06L3yXh0kcgTlML+jAqpDNqj1O5DQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "lDHvcQKKxxGCD500FwItTiT67IoGUCE6VcmT1ozVomE=" -> "okbvYFT2GxqJF+W668RgEGYl4V76VVzSrNiA6vUZ6eg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "392AfyCbuTJxG298SnNnt2UV0/X0hIxXaFy65JdkW6c=" -> "TFpqXfyyrIpw8Cb2NaQ+4lTfzGyofEFvgn+HZOFnNBE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "g/51v1zdArlQtRg11oxk9kuLg5LXX25BvdOZuCGjBXQ=" -> "qqFOiybQSdAnx5rJNml92arvsfM9WhBHJlmv/p6zddk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "rvQUmMqhyBPlIVyoYDaLu4YKoa+81AR9sdfAQiUUGII=" -> "oZJ6T978VjyAuAKvsruUQb5Idi5kPRD/SRXmKpF2Gyo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "O9w/C8nigSd/KvU+eUfcGYp1RW96eyiV9J3VZSHB8G0=" -> "pNsiivq8kgWxA31GifxjiBaVDuG98giWrnQty6N1FeI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "y8qy26iTY4maHlXOtP2uC+vAIHfSzWMSpRlp/Yl/FZ0=" -> "HvwcMmgwzUrZBaSoU5yausAKV1/sLI2wkt5jIc7WiYg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "+7RQk09Ld1OwdeP6Sx41zG9wPnp3blLKFW6rW13fD94=" -> "uTWHVDcNMU+bH8Ainl+U9m2YLjpNv584A2Fj8E1CISs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "hbaI97J7SwZ3F1oAxQHAkydCNOsceqTGWjyya8tDBzI=" -> "fI5jvsuEiBuqV3z1cs0SdR9pHFXzZO4b3UK/1W/QggU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "fLa1w7DbEy0DV8A6xS5s/CfIZCBUOPZBm+JXRMch8so=" -> "jkne5r1Fk93sRk6q1XaWy0Eaj1WBilfsycHRmq+V13A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "f1BFU6lDakX/t9KxofgTVFKXJ44JzQz79fudbEr0twk=" -> "687wLqOq9y195ZGgvvrfnO9eVIhxg/V/BnJUdN6KwAU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "LptOGTlp2yo+TeDeTzxYMjCOifoyIszBqWjw+wfNlvY=" -> "edSg72NQ6JMQaQKGetSexO93/5NlpabK0voQInfOGx0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "wTbNy/cJislrvDDrGkvOCMn7kmvXQKe4gz/ZC9np+2A=" -> "eBw5asAZ9isqtV3xqE93qOAGvuklWBcbwDtQYFESvcA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "I4kixPMWiYBXzvGDF2iyndwWG1Z4xjAZgFPg+ZDKSb4=" -> "W1XRtmZ74usg7E5wWqEApySmqKZfWQ1jwxrJN1qNdQk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "IZ3AdwM4GCv34fPNKZmutCZl66mfuPD8h9n73/JNrYw=" -> "DnaoNKKfvFLwSxT+Po1viAmWGO7sbJDjuZqnT+RyQSA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "KwUVEhsR5asJcHnUrYjWtMlS71T7ZPILZpeH8bf/17I=" -> "ueTuDkAKJoHo84rQWdDj1AhCsP2jXxoJD+EmCVckByQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "v23u/BjasWbXWFsbe6GMgfZTPxxnF1phohW5k62rWSs=" -> "SNZ/ZPZysSonGT5cLzKEURXE5xLFeHrooLBryUyws8o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q3anz468Y1zvkSoFRJkZvW3MRJ7Zq0ycqcp6NgkGhSQ=" -> "8g+zMjzyp/qb6hFXrNh2PVqLVaaBalu7Ax4B6OBflik="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "SdNV7Jex3TSTjQ0uGLsOfHOLzF6qs27OFRAKqi/3/Bg=" -> "4a8M3Y4A9C/t4lHiqNBre4u+7ozUvor7NXbE7RE1BxQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "da0LjGCf2dHubVQXiIWmVPzC6d/el0zqIhvW/NJ6Xgo=" -> "nKRWCF4qGyxKD0vkAw+sawS6qkWj2Na+GFP0grQGhdw="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "WiwCd7SKsIP/Spc5urB0c8PxWzPGvkuNK7oJemB5yPk=" -> "6P9+KI0hAbBwKXGJzx4CCRQ4dQqZeEI6L4FNjIb4C1k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "4URzcW7IcsfkHvXH9DIl5X2kjUSwraVAWGCDPSfkCj0=" -> "oybQNYA2B0gTO1cqjtAxEpHwaylORiOpo6TMWXSRD2s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "MG4JqipdQyi8Yy0qxhPVpD995ZAQ43I9ESShTatKV8E=" -> "2NxjKJIuwan/JQOcOR5mNs2BeG4FPC+xrM3HveP5ifs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "6Bt4IRY6A75WjxGDs+ejwLoR5PMfVDIoSWhcBs89OwI=" -> "M8SKK4gUasyo4Jf2CyVycVzWTTFZ1uSFq82C0fy0xwI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "IoojPLlydtJb6kTypZEzBDVHL8VgygComOd0A6NfeLY=" -> "f/IuyCVp96zN4BkhyS6NVJWlSjJerXtmyKPZFt4H09w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "1TP/Ao2lorYEvSKWGKW8LGXwMgyG046k0jCgo/Xw6Oc=" -> "mMF+bbfYQ+5o65FtGR1laWmntdq22AowKGwiDP8DG1c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-09T18:29:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "k+2xccoXn6njJZccO7526JZWoFQ1B3pj/KZ5D74dWbo=" -> "/NHuF8zN/RHhlsv/7a1/knJMW+RTnqSRMaNufcLRuJ4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-09T18:30:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "l05RXpzxMjqFE2BanWDkseuknsxSCL+xkVJ7JWIBGhg=" -> "/i4hToMQ1WC1a1DF0/pl6VPtoVtwG3s/yhkcAMx2CzM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-09T18:28:05Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "9e0q7u" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-09T18:28:02Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_integration.get_full_year_total_integration must be replaced
-/+ resource "aws_api_gateway_integration" "get_full_year_total_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "fi0guw" -> (known after apply)
      ~ id                      = "agi-kb7gblbu69-fi0guw-GET" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "fi0guw" -> "giqb91" # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_full_year_total_method must be replaced
-/+ resource "aws_api_gateway_method" "get_full_year_total_method" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-kb7gblbu69-fi0guw-GET" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.querystring.metric"   = false
          - "method.request.querystring.scenario" = false
          - "method.request.querystring.year"     = false
        } -> null
      ~ resource_id          = "fi0guw" -> "giqb91" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_resource.full_year_by_company will be destroyed
  # (because aws_api_gateway_resource.full_year_by_company is not in configuration)
  - resource "aws_api_gateway_resource" "full_year_by_company" {
      - id          = "fi0guw" -> null
      - parent_id   = "giqb91" -> null
      - path        = "/full_year/{company_id}" -> null
      - path_part   = "{company_id}" -> null
      - rest_api_id = "kb7gblbu69" -> null
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-09T18:28:02Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_lambda_permission.apigw_get_full_year_total_lambda must be replaced
-/+ resource "aws_lambda_permission" "apigw_get_full_year_total_lambda" {
      ~ id            = "AllowExecutionFromAPIGateway" -> (known after apply)
      - qualifier     = "" -> null
      ~ source_arn    = (sensitive value) # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 5 to add, 94 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*